# StructuralConnectionType Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralConnectionType Class
Members See Also
---
A type element that represents a connection symbol applied to structural members.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class StructuralConnectionType : ElementType
```

Visual Basic
---
```text
Public Class StructuralConnectionType _
	Inherits ElementType
```

Visual C++
---
```text
public ref class StructuralConnectionType : public ElementType
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB.Structure..::..StructuralConnectionType
# See Also
StructuralConnectionType Members
Autodesk.Revit.DB.Structure Namespace